[
  {
    "date": "June 23, 2025",
    "title": "A new place",
    "summary": "Welcome Internet travelers to my domain.",
    "content": "<p>This is just a fun place where I document my ideas, problems, and solutions to various computer problems I may be experiencing or working on. This week's project has been getting this website up and running! Hope you find all the easter eggs! Report any bugs at Bugs@BibbyJohn.com</p>"
  },
  {
    "date": "June 22, 2025",
    "title": "Redstone is back again",
    "summary": "The java based Discord bot that has been inactive for years is now back!",
    "content": "<p>The bot has been completely re-written in python and almost all legacy features are in the process of being ported over! A new era for this fun bot.</p><h4 class='text-lg font-bold mt-4 mb-2 text-gray-200'>New features</h4><ul class='list-disc list-inside text-gray-300 space-y-2'><li><strong>Better error handling:</strong> A robust error handling system has been introduced to combat silent failures and bot crashes.</li><li><strong>New Console:</strong> There is now a new console view for when the bot turns on that displays Ascii art and now accepts developer commands.</li><li><strong>Better Performance:</strong> The new rewrite has allowed for much better performance and less lag when issuing commands.</li><li><strong>Coming soon:</strong> Once the features are fully ported over, the invite link will be made shared via the bot's website. Stay tuned!</li></ul>"
  },
  {
    "date": "May 25, 2025",
    "title": "Live migration from Ubuntu 24.10 (ARM) to Debian 13 (ARM)",
    "summary": "Swapping Ubuntu for Debian without an installer. Do not do this on a production system unless you know what you are doing.",
    "content": "<p>Ubuntu is incredble distro. It unfortanly gets a lot of hate for its lack of consistancy and always changing nature. However, it got me thinking, what if I turned my Ubuntu Desktop instance into Debian? That sounds crazy/ However, after several hours of life being spent on this random nonsensical questions. I am happy to report that it is possible. I will be working on a guide on how to do this properly in the future. \n For the time being, however, the general idea is to slowly replace each ubuntu component to its debian counterpart. This is a very delicate process that can break your system if not done correctly. There are a lot of moving parts but doing this can teach you a lot about how linux works. Best way to fix something is by breaking it.</p>"
  },
  {
    "date": "March 10, 2025",
    "title": "Bash still remains the default",
    "summary": "After extensively using Zsh and Fish shells, I am reminded why Bash will always be the best.",
    "content": "<p>I do miss autocomplete that both zsh and fish offer. However, lot of the features I need are within bash, if you take time to configure them. For instance, I had no idea that bash had case insensitivty or you can configure every aspect of the shell. For a long time I used Oh My Bash. However, I was never interested in their plugins or other integrations. After a while it made no sense to use it anymore just for a different colored prompt. Therefore, I took on the venture of developing my own .bashrc file. I think it came out great! Still some kinks to work out here and there but overall it fits my needs! I will be putting up the .bashrc file in my repo at somepoint.</p>"
  },
  {
    "date": "January 1, 2025",
    "title": "Issues with Proxmox. ",
    "summary": "Proxmox is an incredible Type-1 Hypervisor, however, uninstalling it can be a challenge.",
    "content": "<p>I have used proxmox for several years for all my serious virtual machine needs. It is an extremely powerful hypervisor that only uses a little bit of resources while being able to spin up high-quality VM's that almost feels native. However, as I was migrating my proxmox instance to newer hardware, I noticed altering my existing proxmox instance into a Ubuntu server was not an easy task. After many failed attempts (and thoughts that maybe my flash drivers were going bad.) I realized it was because proxmox was somehow keeping my hardrive locked from changes via installers. It was only after a forceful wipe through the command-line was I able to completely remove proxmox and install a fresh instance of Ubuntu.</p>"
  }
]

